
&НаСервере
Процедура ЗаполнитьГрафикНаСервере()
	
	ДатаНачала = Период.ДатаНачала;
	ДатаОкончания = Период.ДатаОкончания;
	Дата = ДатаНачала;
	
	ТЗ = РеквизитФормыВЗначение("ШаблонДниНедели");
	
	Пока Дата <= ДатаОкончания Цикл
		
		СтрокаТЗ = ТЗ[ДеньНедели(Дата) - 1];
		
		Если СтрокаТЗ.Включать = Истина Тогда
			МенеджерЗаписи = РегистрыСведений.ГрафикРаботы.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ГрафикРаботы = ГрафикРаботы;
			МенеджерЗаписи.Дата = Дата;
			МенеджерЗаписи.Значение = Истина;
			МенеджерЗаписи.Записать();
		Иначе
			МенеджерЗаписи = РегистрыСведений.ГрафикРаботы.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ГрафикРаботы = ГрафикРаботы;
			МенеджерЗаписи.Дата = Дата;
			МенеджерЗаписи.Значение = Ложь;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
		Дата = НачалоДня(Дата + (60 * 60 * 24)); 
		
	КонецЦикла;
	
	//ДеньНеделиВГрафике = ТЗ.Получить(ДеньНедели(Дата));
	
	//Пока Дата <= ДатаОкончания Цикл
	//	
	//	 
	//	ДеньНеделиВГрафике = ТЗ.Получить(ДеньНедели(Дата));
	//	
	//	//Если ДеньНеделиВГрафике.Включать = Истина Тогда
	//	//	МенеджерЗаписи = РегистрыСведений.ГрафикРаботы.СоздатьМенеджерЗаписи();
	//	//	МенеджерЗаписи.ГрафикРаботы = ГрафикРаботы;
	//	//	МенеджерЗаписи.Дата = Дата;
	//	//	МенеджерЗаписи.Значение = Истина;
	//	//	МенеджерЗаписи.Записать();
	//	//	
	//	//	Дата = НачалоДня(Дата + (60 * 60 * 24));
	//	//КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	ЗаполнитьГрафикНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Массив = Новый Массив;
	Массив.Добавить("Понедельник");
	Массив.Добавить("Вторник");
	Массив.Добавить("Среда");
	Массив.Добавить("Четверг");
	Массив.Добавить("Пятница");
	Массив.Добавить("Суббота");
	Массив.Добавить("Воскресенье");
	
	ДеньНедели = 0;
	КолВоДнейНедели = 7;
	
	Пока ДеньНедели < КолВоДнейНедели Цикл
		
		НоваяСтрока = ШаблонДниНедели.Добавить();
		НоваяСтрока.ДеньНедели = Массив[ДеньНедели];
		
		ДеньНедели = ДеньНедели + 1;
		
	КонецЦикла;
	
	
КонецПроцедуры