#Область ОбработчикиСобытийЭлементовТаблицыФормыПереченьНоменклатуры

&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура);
	
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьКонтрагент(Команда)

	Сообщить(Объект.Клиент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьТоварыНаСервере(Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиМатериаловОстатки.Материал КАК Материал,
		|	ОстаткиМатериаловОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиМатериалов.Остатки(, Склад = &Склад) КАК ОстаткиМатериаловОстатки";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТовары(Команда)
	
	ТЗОстатки = ЗаполнитьТоварыНаСервере(Объект.Склад);
	
	Для каждого СтрокаТЗ Из ТЗОстатки Цикл
	
		НоваяСтрока = Объект.ПереченьНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура = СтрокаТЗ.Материал;
	
	КонецЦикла;
	
КонецПроцедуры
